_protected/frontend/modules/osh/views/oshinjuryopenn/_form.php

SELECT * FROM `s_documenttype`
---
 <legend class="scheduler-border" >Employee information</legend>
 <div class='row'>
<div class="col-md-4">
    <?= $form->field($person, 'document_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Sdocumenttype::find()->all(),'id','documenttype'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select document type',
                                'onchange'=>'

                                // To get dropdownlist for courses

                                   var id = document.getElementById("rdperson-document_id").value;
                                   if(id == 1){
                                    $("#nid" ).show();
                                    $("#passport" ).hide();
                                    $("#document" ).hide();
                                   }
                                   else if(id == 2){
                                    $("#passport" ).show();
                                    $("#nid" ).hide();
                                    $("#document" ).hide();
                                   }
                                    else{
                                    $("#nid" ).hide();

SELECT * FROM `s_countrycode_iso3166`
---

<div id='country' style='display:none'>
 <div class="col-md-4">
    <?= $form->field($person, 'country_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Scountrycodeiso3166::find()->all(),'id','cc_description'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select document type',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);

SELECT * FROM `s_sex`
SELECT * FROM `s_province`
---
    ?>
 </div>
 <div class="col-md-4" id='sex' style='display:block'>
 <?= $form->field($person, 'sex_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Ssex::find()->all(),'id','sex'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select sex',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);
                            ?>
 </div>
 <div class="col-md-4" id='province' style='display:block'>
 <?= $form->field($person, 'province_id')->widget(select2::classname(),[
                        'data'=>ArrayHelper::map(Sprovince::find()->all(),'id','province'),
                        'theme' => Select2::THEME_KRAJEE,
                        'options'=>[
                            'placeholder'=>'Select province',
                            'onchange'=>'

                                $.post("'.Url::to(['../sdistrict/lists', 'id'=> '']).'"+$(this).val(),function(data){
                                     $("select#rdperson-district_id" ).html(data);
                                });'
                        ],
                        'language' => 'en',
                        'pluginOptions'=>['alloweClear'=>true],
                        ]);

SELECT * FROM `s_district` WHERE province_id=0
SELECT * FROM `s_geosector` WHERE district_id=0
SELECT * FROM `s_cell` WHERE sector_id=0
---
</div>
<div class='row'>
 <div class="col-md-4" id='district' style='display:block'>
 <?= $form->field($person, 'district_id')->widget(select2::classname(),[
'data'=>ArrayHelper::map(Sdistrict::find()->where('province_id=0')->all(),'id','district'),
'theme' => Select2::THEME_KRAJEE,
'options'=>[
    'placeholder'=>'Select district',
    'onchange'=>'
         $.post("'.Url::to(['../sgeosector/lists', 'id'=> '']).'"+$(this).val(),function(
         data){
             $("select#rdperson-sector_id" ).html(data);
        });'
],
'language' => 'en',
'pluginOptions'=>['alloweClear'=>true],
]);
?>
 </div>
 <div class="col-md-4" id='sector' style='display:block'>
 <?= $form->field($person, 'sector_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Sgeosector::find()->where('district_id=0')->all(),'id','sector'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select sector',
                                'onchange'=>'
                                    $.post("'.Url::to(['../scell/lists', 'id'=> '']).'"+$(this).val(),function(data){
                                         $("select#rdperson-cell_id" ).html(data);
                                    });'
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);
                            ?>
 </div>
 <div class="col-md-4" id='cell' style='display:block'>
 <?= $form->field($person, 'cell_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Scell::find()->where('sector_id=0')->all(),'id','cell'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select cell',
                                'onchange'=>'
                                    $.post("'.Url::to(['../svillage/lists', 'id'=> '']).'"+$(this).val(),function(data){
                                         $("select#rdperson-village_id" ).html(data);
                                    });'
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);

SELECT * FROM `s_village` WHERE cell_id=0
---
</div>
<div class='row'>
<div class="col-md-4" id='village' style='display:block'>
<?= $form->field($person, 'village_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Svillage::find()->where('cell_id=0')->all(),'id','village'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select village',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);

SELECT * FROM `rd_employer`
SELECT * FROM `s_isco08_level4`
---

 <div class='row' >
  <div class="col-md-4">
   <?= $form->field($model, 'employer_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Rdemployer::find()->all(),'id','companyName'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select Establishment',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);
                            ?>
 </div>
  <div class="col-md-4">
   <?= $form->field($model, 'occupation_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Sisco08level4::find()->all(),'id','occupation'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select occupation',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);

SELECT * FROM `s_injurytype`
---
    ?>
 </div>
 <div class="col-md-4">
    <?= $form->field($model, 'injuryType_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Sinjurytype::find()->all(),'id','type'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select type',
                                'onchange'=>'
                                   var id = document.getElementById("oshinjuryopenn-injurytype_id").value;
                                   if(id == 1){
                                    $("#accident" ).show();
                                    $("#desease" ).hide();
                                   }
                                    else{
                                    $("#accident" ).hide();
                                    $("#desease" ).show();

                                    };'

                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);

SELECT * FROM `s_frequency`
SELECT * FROM `s_injurycause` WHERE `id`<>1
SELECT * FROM `s_accident` WHERE `id`<>1
SELECT * FROM `s_desease` WHERE injurycause_id=0
---

<div class='row'>
    <div class="col-md-4">
    <?= $form->field($model, 'frequency_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Sfrequency::find()->all(),'id','frequency'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select frequency',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);
                            ?>
    </div>
    <div class="col-md-4">
     <?= $form->field($model, 'cause_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Sinjurycause::find()
                                ->where(['NOT IN','id',[1]])->all(),'id','cause'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select cause',
                                'onchange'=>'

                                $.post("'.Url::to(['../sdesease/lists', 'id'=> '']).'"+$(this).val(),function(data){
                                     $("select#oshinjuryopenn-desease_id" ).html(data);
                                });'
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);
                            ?>
    </div>
    <div class="col-md-4" id='accident' style='display:block'>
    <?= $form->field($model, 'accident_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Saccident::find()->where(['NOT IN','id',[1]])->all(),'id','accident'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select accident type',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);
                            ?>
    </div>
    <div class="col-md-4" id='desease' style='display:none'>
    <?= $form->field($model, 'desease_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Sdesease::find()
                                ->AndWhere('injurycause_id=0')
                                ->all(),'id','desease'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select desease',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);

SELECT * FROM `s_injurycategory`
SELECT * FROM `s_injurypartofthebody`
SELECT * FROM `s_noyes`
---

    <div class='row'>
    <div class="col-md-4">
    <?= $form->field($model, 'injuryCategory_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Sinjurycategory::find()->all(),'id','category'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select category',
                                'onchange'=>'
                                   var id = document.getElementById("oshinjuryopenn-injurycategory_id").value;
                                   if(id == 6){
                                    $("#returndate" ).hide();
                                   }
                                    else{
                                    $("#returndate" ).show();

                                    };'
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);
                            ?>
    </div>
    <div class="col-md-4">
     <?= $form->field($model, 'partOfTheBody_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Sinjurypartofthebody::find()->all(),'id','partOfTheBody'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select part of the body',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);
                            ?>
    </div>
    <div class="col-md-4">
 <?= $form->field($model, 'oshTrainingRelatedToOccupation_id')->widget(select2::classname(),[
                            'data'=>ArrayHelper::map(Snoyes::find()->all(),'id','noyes'),
                            'theme' => Select2::THEME_KRAJEE,
                            'options'=>[
                                'placeholder'=>'Select the answer',
                            ],
                            'language' => 'en',
                            'pluginOptions'=>['alloweClear'=>true],
                            ]);