_protected/frontend/controllers/SdeseaseController.php

    public function actionLists($id){

        $countDesease = Sdesease::find()
                    ->where('injurycause_id=:u',['u'=>$id])
                    ->count();

        $deseases = Sdesease::find()
                   ->where('injurycause_id=:u',['u'=>$id])
                    ->all();
---
SELECT COUNT(*) FROM `s_desease` WHERE injurycause_id='2'
SELECT * FROM `s_desease` WHERE injurycause_id='2'