_protected/frontend/modules/registrationderegistration/controllers/RdpersonController.php

SELECT COUNT(*) FROM `rd_person` WHERE nid='1234567890123456'
SELECT * FROM `rd_person` WHERE nid='1234567890123456'
---
    public function actionLists($id){

        $countPersons = Rdperson::find()
                    ->where('nid=:u',['u'=>$id])
                    ->count();

        $person = Rdperson::find()->where('nid=:u',['u'=>$id])->one();