_protected/frontend/modules/osh/controllers/OshinjuryopennController.php

SELECT * FROM `osh_injuryopenn` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Oshinjuryopenn::findOne($id)) !== null) {